<template>
    <div class="modal-overlay" v-if="isShow && !isSpecial">
        <div class="modal">
            <div class="modal-img">
                <svg class="delete-icon" viewBox="0 0 22 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M19.4375 2.8125H15.257L14.7999 1.44197C14.6602 1.02186 14.3917 0.656438 14.0325 0.397592C13.6733 0.138746 13.2417 -0.000368497 12.799 7.33091e-07H9.20098C8.75819 -0.000293168 8.32655 0.13884 7.96728 0.397666C7.60801 0.656492 7.33935 1.02187 7.19942 1.44197L6.74291 2.8125H2.5625C1.39934 2.8125 0.453125 3.75872 0.453125 4.92188V6.32813C0.453125 7.11131 1.15817 7.03125 1.91483 7.03125H20.8438C21.2324 7.03125 21.5469 6.71677 21.5469 6.32813V4.92188C21.5469 3.75872 20.6007 2.8125 19.4375 2.8125ZM8.22561 2.8125L8.53358 1.88691C8.58026 1.74685 8.66985 1.62505 8.78965 1.53878C8.90944 1.45251 9.05336 1.40614 9.20098 1.40625H12.799C13.1018 1.40625 13.3703 1.59919 13.4658 1.88691L13.7741 2.8125H8.22561ZM2.03122 8.53125L3.15233 22.0815C3.25189 23.1753 4.15484 24 5.2528 24H16.7472C17.8452 24 18.7482 23.1753 18.8484 22.0753L19.9689 8.53125H2.03122ZM7.48438 20.4844C7.48438 21.4112 6.07812 21.415 6.07812 20.4844V10.6406C6.07812 9.71377 7.48438 9.70997 7.48438 10.6406V20.4844ZM11.7031 20.4844C11.7031 21.4112 10.2969 21.415 10.2969 20.4844V10.6406C10.2969 9.71377 11.7031 9.70997 11.7031 10.6406V20.4844ZM15.9219 20.4844C15.9219 21.4112 14.5156 21.415 14.5156 20.4844V10.6406C14.5156 10.252 14.8301 9.9375 15.2188 9.9375C15.6074 9.9375 15.9219 10.252 15.9219 10.6406V20.4844Z" fill="#2B2A29"/>
                </svg>
            </div>
            <h4>Удаление награды</h4>
            <span>Вы уверены, что хотите удалить награду?</span>
            <div class="modal-controls">
                <Button bgColor="wheat-btn" @click="closePopup">Не удалять</Button>
                <Button @click="deleteOrder">Удалить</Button>
            </div>
        </div>
    </div>
    <div class="modal-overlay" v-else-if="isSave && isFormValid">
        <div class="modal">
            <div class="modal-img">
                <svg class="success-icon" viewBox="0 0 128 128" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M88 60C82.4621 60 77.0486 61.6422 72.444 64.7189C67.8395 67.7955 64.2506 72.1685 62.1314 77.2849C60.0121 82.4012 59.4576 88.0311 60.538 93.4625C61.6184 98.894 64.2851 103.883 68.201 107.799C72.1169 111.715 77.106 114.382 82.5375 115.462C87.9689 116.542 93.5988 115.988 98.7151 113.869C103.831 111.749 108.204 108.161 111.281 103.556C114.358 98.9514 116 93.5379 116 88C115.986 80.5783 113.031 73.4645 107.783 68.2166C102.535 62.9686 95.4217 60.0141 88 60ZM98.6667 85.4933L88 96.16C87.25 96.9091 86.2333 97.3298 85.1733 97.3298C84.1133 97.3298 83.0967 96.9091 82.3467 96.16L77.0133 90.8267C76.6396 90.4475 76.3453 89.9976 76.1478 89.5032C75.9502 89.0088 75.8533 88.48 75.8627 87.9477C75.8722 87.4154 75.9878 86.8903 76.2028 86.4033C76.4178 85.9163 76.7279 85.4771 77.1148 85.1114C77.5018 84.7457 77.9578 84.461 78.4562 84.2739C78.9547 84.0868 79.4854 84.0011 80.0174 84.0217C80.5494 84.0424 81.0719 84.1691 81.5543 84.3943C82.0367 84.6195 82.4693 84.9388 82.8267 85.3333L85.3333 87.84L93.1733 80C93.4728 79.4732 93.8881 79.0214 94.3878 78.6786C94.8874 78.3358 95.4585 78.111 96.0577 78.0212C96.657 77.9314 97.2688 77.9789 97.847 78.1602C98.4252 78.3414 98.9547 78.6517 99.3955 79.0675C99.8362 79.4833 100.177 79.9938 100.391 80.5605C100.606 81.1272 100.689 81.7352 100.634 82.3387C100.579 82.9421 100.388 83.5253 100.075 84.0441C99.762 84.5628 99.3351 85.0037 98.8267 85.3333L98.6667 85.4933ZM60.32 49.2267L17.6533 12.5333C18.6496 12.1925 19.6938 12.0125 20.7467 12H101.653C102.706 12.0125 103.75 12.1925 104.747 12.5333L62.08 49.2267C61.8453 49.4366 61.5415 49.5526 61.2267 49.5526C60.9118 49.5526 60.608 49.4366 60.3733 49.2267H60.32ZM52 88C51.9734 88.444 51.9734 88.8893 52 89.3333H21.0133C18.6742 89.3763 16.4132 88.4916 14.7243 86.8727C13.0354 85.2538 12.056 83.0322 12 80.6933V20.64C12.0159 19.8618 12.1415 19.0897 12.3733 18.3467L55.04 55.2533C55.4031 55.5706 55.8181 55.8231 56.2667 56C57.6985 56.9722 59.3893 57.4919 61.12 57.4919C62.8507 57.4919 64.5415 56.9722 65.9733 56C66.4219 55.8231 66.8369 55.5706 67.2 55.2533L109.867 18.3467C110.098 19.0897 110.224 19.8618 110.24 20.64V60.0533C104.958 55.7726 98.572 53.0751 91.8207 52.273C85.0694 51.4709 78.229 52.5969 72.0911 55.5208C65.9532 58.4446 60.7687 63.0468 57.1377 68.7947C53.5066 74.5426 51.5774 81.2013 51.5733 88H52Z" fill="#88D05E"/>
                </svg>
            </div>
            <h4>Сведения успешно отправлены</h4>
            <span>Сведения о герое были успешно отправлены и в скором времени будут размещены в нашем архиве</span>
            <div class="modal-controls">
                <Button @click="closePopup">Закрыть</Button>
            </div>
        </div>
    </div>
    <div class="modal-overlay" v-else-if="isSpecial && isShow">
        <div class="modal">
            <div class="modal-img">
                <svg width="128" height="128" viewBox="0 0 128 128" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M64 128C99.3462 128 128 99.3462 128 64C128 28.6538 99.3462 0 64 0C28.6538 0 0 28.6538 0 64C0 99.3462 28.6538 128 64 128Z" fill="#80011F"/>
                  <path d="M64.0001 76.8C61.6824 76.7999 59.4547 75.903 57.7835 74.297C56.1124 72.6911 55.1275 70.5009 55.0351 68.185L53.8526 38.325C53.8052 37.118 54.0019 35.9139 54.4311 34.7848C54.8602 33.6557 55.5129 32.6248 56.3501 31.7541C57.1872 30.8833 58.1916 30.1905 59.3029 29.7173C60.4143 29.244 61.6097 29.0001 62.8176 29H65.1826C66.3905 29.0001 67.586 29.244 68.6973 29.7173C69.8087 30.1905 70.8131 30.8833 71.6502 31.7541C72.4873 32.6248 73.1401 33.6557 73.5692 34.7848C73.9983 35.9139 74.1951 37.118 74.1476 38.325L72.9651 68.185C72.8728 70.5009 71.8879 72.6911 70.2167 74.297C68.5456 75.903 66.3178 76.7999 64.0001 76.8Z" fill="#F2E5CC"/>
                  <path d="M72.958 90.0425C72.958 85.0954 68.9476 81.085 64.0005 81.085C59.0534 81.085 55.043 85.0954 55.043 90.0425C55.043 94.9896 59.0534 99 64.0005 99C68.9476 99 72.958 94.9896 72.958 90.0425Z" fill="#F2E5CC"/>
                </svg>
            </div>
            <h4>Раздел недоступен</h4>
            <span>Наполнение информации будет доступно после окончания СВО</span>
            <div class="modal-controls">
                <Button @click="closePopup">Закрыть</Button>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
import Button from './Button.vue';
import { useValidationStore } from '../../store/validationStore';
import { computed } from 'vue';

defineProps({
  isShow: {
    type: Boolean,
    default: false
  },
  isSave: {
    type: Boolean,
    default: false
  },
  isSpecial: {
    type: Boolean,
    default: false
  }
})

const emit = defineEmits(['delete', 'close'])
const validationStore = useValidationStore()
const isFormValid = computed(() =>  validationStore.isValid)
const deleteOrder = () => {
  emit('delete')
}

const closePopup = () => {
  emit('close')
}
</script>

<style scoped lang="scss">
@use '../../root.scss' as *;
.modal-overlay {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.5);
  display: flex;
  align-items: center;
  justify-content: center;
  z-index: 1000;
}

.modal {
  background: $order-bg;
  border-radius: 32px;
  padding: 32px;
  max-width: 604px;
  width: 100%;
  max-height: 90%;
  overflow-y: auto;
  box-shadow: 0 10px 30px rgba(0, 0, 0, 0.1);
  position: relative;
  display: flex;
  flex-direction: column;
  align-items: center;
  gap: 32px;
  transform: translateY(-20px) scale(0.95);
  transition: transform 0.3s ease;
  text-align: center;
  .modal-controls {
    display: flex;
    gap: 20px;
    width: 100%;
    justify-content: center;
  }
  .delete-icon {
    max-width: 128px;
    width: 100%;
    height: 128px;
    path {
      fill: $red-color;
    }
  }
  .success-icon {
    max-width: 128px;
    width: 100%;
    height: 128px;
  }
  h4 {
    font-size: 40px;
    text-transform: uppercase;
    font-weight: 400; 
  }
  span {
    font-size: 20px;
    color: $gray-color;
  }
}

@media (max-width: 360px) {
  .modal {
    h4 {
      font-size: 24px;
    }
    span {
      font-size: 14px;
    }
    .modal-controls {
      flex-direction: column;
      button {
        max-width: 100%;
        font-size: 14px;
      }
    }
    .modal-img {
      max-width: 80px;
      width: 100%;
      height: 80px;
    }
  }
}
</style>
